import streamlit as st

st.set_page_config(page_title="Happy Birthday Janjon", page_icon="🐣", layout="centered")
st.markdown(”””

<style>
.main {
    background-color: #f8f1ea;
}
h1,h2,h3,p {
    text-align:center;
}
.stButton>button {
    width:100%;
    border-radius:20px;
    height:50px;
    font-size:18px;
}
</style>

“””, unsafe_allow_html=True)

st.markdown(”💌 Happy Birthday Janjon 💌”, unsafe_allow_html=True)

st.markdown(”### أدخلي الكلمة السرية ❤️”)

password = st.text_input(””, type=“password”)

if password == “2972009”:

st.success("تم فتح الرسالة ❤️")
st.balloons()
st.image("janjon.jpg", use_container_width=True)
st.markdown("""

أهلاً بالكتكوتة اللي كبرت سنة ❤️✨

النهاردة إنتي كبرتي سنة، بس كل سنة بتمر بتزودك جمال في عيني وقرب في قلبي أكتر من اللي قبلها.

كل سنة وإنتي طيبة ❤️

وجودك مش بس حلى أيامي، ده خلاني أعرف يعني إيه أحب بجد وأحس إن قلبي مبسوط ومكتفي بيكي، وإن يومي بيكمل بيكي.

معاكي ببقى على طبيعتي من غير أي حسابات، وبفك من أي ضغط لمجرد إني بكلمك أو أسمع صوتك.

فيكي تفاصيل بتخطف القلب.. ضحكتك، طريقتك في الكلام، وبساطتك اللي بتخلي أي حاجة حواليكي أهدى وأحلى.

بصة واحدة في عينيكي كفاية تخليني أنسى الدنيا كلها.

وعارفة يا جنجون، أكتر حاجة بحبها فيكي إنك طبيعية جدًا، مفيكيش أي تصنع، وكل حاجة فيكي حقيقية وده اللي مخليكي مميزة بجد في عيني.

ولما بفضل أهزر وأناكف فيكي، فده عشان بحب أشوف رياكشناتك وبحب أطلع الطفلة اللي جواكي.

وعلفكرة إنتي عارفة إن دمي خفيف جدًا، بس كبريائك وغرورك هما اللي مانعينك تعترفي.. بطلي مقاوحة بقى 😂❤️

وجودك في حياتي فرق كبير، مش بس في يومي، ده حسسني إني أخدت نصيبي الحلو من الدنيا فيكي.

بدعي ربنا دايمًا إن السنة الجاية تكون أحلى، وإن قلبك يفضل مبسوط، وضحكتك تفضل منورة وشك، ومفيش حاجة في الدنيا تقدر تعكّر عليكي.

كل سنة وإنتي منورة حياتي، وكل سنة وإنتي القريبة لقلبي ❤️

عقبال عمر بحاله نعيشه سوا، ونحتفل بيكي دايمًا وإيدي مابتسيبش إيدك ✨

⸻

❤️ رسالة أخيرة ❤️

وفي الآخر، مهما كتبت كلام، عمره ما هيكفي يوصف قد إيه إنتي غالية عندي وقد إيه وجودك مفرق معايا.

كل سنة وإنتي أحلى حاجة في حياتي يا جنجون 🎂❤️

بحبك ❤️

- زياد

“””)

else:
if password:
st.error(“الكلمة السرية غير صحيحة 😅”)
